{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "gpt2-medium",
  "bias": "none",
  "fan_in_fan_out": true,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "qa_outputs"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "c_attn",
    "c_proj"
  ],
  "task_type": "QUESTION_ANS",
  "use_dora": false,
  "use_rslora": false
}